Revit 2015 API
DaylightPortalNode Class
 This is a class representing a Daylight Portal in a model-exporting process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public class DaylightPortalNode : ContentNode
Visual Basic
Public Class DaylightPortalNode _
	Inherits ContentNode
Visual C++
public ref class DaylightPortalNode : public ContentNode
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.DaylightPortalNode
See Also
DaylightPortalNode Members
Autodesk.Revit.DB Namespace